Revit 2027 API
Face.Triangulate Method
Returns a triangular mesh approximation to the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Mesh Triangulate()
Public Function Triangulate As Mesh
public:
Mesh^ Triangulate()
member Triangulate : unit -> Mesh
Return Value
Mesh
Remarks
Tolerance of approximation is defined internally by Revit to be adequate for display purposes.
Example
private void TriangulateFace(Face face)
{
    // Get mesh
    Mesh mesh = face.Triangulate();
    for (int i = 0; i < mesh.NumTriangles; i++)
    {
        MeshTriangle triangle = mesh.get_Triangle(i);
        XYZ vertex1 = triangle.get_Vertex(0);
        XYZ vertex2 = triangle.get_Vertex(1);
        XYZ vertex3 = triangle.get_Vertex(2);
    }
}
See Also
Reference
Face Class
Triangulate Overload
Autodesk.Revit.DB Namespace